docs/produkte/silverdat-3-valuatefinanc/schnittstellenoperat/request-getyea-2231.md

---
title: "Request getYearMonthsForVehicleTargetDateEvaluationHistory"
topic_id: "2231"
breadcrumb: "SilverDAT Produkte > SilverDAT 3 valuateFinance > Schnittstellenoperationen > Hilfsfunktionen > Jahr und Monat der stichtagsbezogenen Bewertung erfragen > Request getYearMonthsForVehicleTargetDateEvaluationHistory"
---

# Request getYearMonthsForVehicleTargetDateEvaluationHistory

```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eval="http://sphinx.dat.de/services/Evaluation">
   <soapenv:Header/>
   <soapenv:Body>
      <eval:getYearMonthsForVehicleTargetDateEvaluationHistory>
         <request>
            <locale country="DE" datCountryIndicator="DE" language="de"/>
         </request>
      </eval:getYearMonthsForVehicleTargetDateEvaluationHistory>
   </soapenv:Body>
</soapenv:Envelope>
```
